# EditorInteraction Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
EditorInteraction Class
Members See Also
---
Wraps the EditorInteractionType for the Pane to allow for clients to override their type dynamically if need be.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class EditorInteraction
```

Visual Basic
---
```text
Public Class EditorInteraction
```

Visual C++
---
```text
public ref class EditorInteraction
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI..::..EditorInteraction
# See Also
EditorInteraction Members
Autodesk.Revit.UI Namespace